[
{"Course ID":"006987","Subject":"ACC","Catalog":"393","Long Title":"Independent Study","Component":"IND","Descr":"For those students in the last semester of their senior year who require one to three credits to meet minimum requirements for graduation. Students must complete an Application for Independent Study to be approved by the Department Chair and the Dean. Students are assigned to a faculty member who supervises the Independent Study course or project. Student may be required to write a research paper in addition to all other course requirements.","Institution":"LIUNV","Acad Org":"BMANAGESCI"},
{"Course ID":"003170","Subject":"ANT","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty.  To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00, a 3.25 ratio in their major, and the permission of the Chair of the Department and of the Dean.  A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"000692","Subject":"ANT","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Students undertake rigorous, semester-long independent work under the supervision of a faculty member.  The topic and specific assignments to be completed must be agreed upon in advance and approved by the Department Chair and the Dean.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"006340","Subject":"ANT","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Students undertake rigorous, semester-long independent work under the supervision of a faculty member.   The topic and specific assignments to be completed must be agreed upon in advance and approved by the Department Chair and the Dean.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"010197","Subject":"BIC","Catalog":"196","Long Title":"Honors Research","Component":"IND","Descr":"Honors study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Department Chair and the Dean. A total of six credits of Honors Study is the maximum allowed.  Not open to students who have successfully completed Biochemistry 186, 187.","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"003196","Subject":"BIC","Catalog":"186","Long Title":"Senior Research","Component":"IND","Descr":"Laboratory and library research on a  special problem, written report required. Pass/Fail only. Open only to qualified students with the permission of the Department Chair and the faculty research adviser.","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"004130","Subject":"BIC","Catalog":"187","Long Title":"Senior Research","Component":"IND","Descr":"Laboratory and library research on a special problem, written report required. Pass/Fail only. Open only to qualified students with the permission of the Department Chair and the faculty research adviser.","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"009283","Subject":"BIO","Catalog":"123","Long Title":"Advanced Field Ecology","Component":"FLD","Descr":"An intensive study of one particular locality, the current focus being on an Aegean Island of Greece. Students work alone or in groups to study one environmental aspect in depth, such as reptiles, insects, hydrology, vegetation communities, etc. Two classes on campus precede field activity; class is at study site for two to three weeks. Students maintain a field journal to be submitted with project report. Travel expenses are incurred.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"019002","Subject":"BIO","Catalog":"199","Long Title":"Biology Internship","Component":"INT","Descr":"During their senior year, Biology majors can undertake one internship within the area of biology/clinical research.  Consultation with the Chairperson and approval of the Department is required.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"008918","Subject":"BIO","Catalog":"120","Long Title":"Field Study in Ecology","Component":"FLD","Descr":"Each year the ecology of a different part of the world is studied; for example, Florida, Costa Rica, the American Southwest or the Galapagos. Emphasis is on the biota of a region and their adaptations and evolution. Local habitats are interpreted in an ecological context along with the role of human influence. Depending on locality, field techniques may include hiking, snorkeling, animal observation and identification, and water/ soil analysis. Lectures are interdisciplinary and suitable for all disciplines. Requirements include a field notebook, quizzes and a final report. Three days on campus plus 10 to 12 days at the field site. Travel expenses are incurred.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"007430","Subject":"BIO","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.25 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean.  Students are required to have had an advanced Biology elective with the faculty member teaching the class. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"007015","Subject":"BIO","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.25 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean.  Students are required to have had an advanced Biology elective with the faculty member teaching the class. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"010727","Subject":"BIO","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Prerequisite: Student must have had at least one upper-level course in the area of interest as well as permission of the Chair of the Department and the Dean.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"001659","Subject":"BIO","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Prerequisite: Student must have had at least one upper-level course in the area of interest as well as permission of the Chair of the Department and the Dean.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"010362","Subject":"CHM","Catalog":"195","Long Title":"Honors Research","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Department Chair and the Dean. A total of six credits of Honors Study is the maximum allowed. (Not open to students who have successfully completed CHM 186, 187.)","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"003576","Subject":"CHM","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Department Chair and the Dean. A total of six credits of Honors Study is the maximum allowed. (Not open to students who have successfully completed CHM 186, 187.)","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"003575","Subject":"CHM","Catalog":"186","Long Title":"Senior Research","Component":"IND","Descr":"Laboratory and library research on a special problem; written report required. Pass/Fail only. Open only to qualified students with the permission of the Department Chair and the Faculty Research Adviser or advisers.  Prerequisite: CHM 136. Offered every semester.","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"005222","Subject":"CHM","Catalog":"187","Long Title":"Senior Research","Component":"IND","Descr":"Laboratory and library research on a special problem; written report required. Pass/Fail only. Open only to qualified students with the permission of the Department Chair and the Faculty Research Adviser.  Prerequisite: CHM 136. Offered every semester.","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"011453","Subject":"CS","Catalog":"170","Long Title":"Computer Science Internship","Component":"INT","Descr":"An opportunity to extend classroom knowledge and gain direct practical experience in the computer field as an intern with a New York City government agency or with a major corporation in the metropolitan area. Students receive meaningful internship assignments and are directed by professionals in the normal working environment. Each student is required to schedule meetings with a faculty adviser, who provides academic supervision. May be taken twice for up to six credits. Completion of sophomore year and recommendation of the Department Chair are required.","Institution":"LIUNV","Acad Org":"BTICS"},
{"Course ID":"008517","Subject":"ECO","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality- point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean.  A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"008883","Subject":"ECO","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality- point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"005577","Subject":"ECO","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Independent reading and research in the chosen field of economics. Training is provided in techniques of critical analysis and independent research. Permission of the Chair and the Dean.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"004999","Subject":"ECO","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Independent reading and research in the chosen field of economics. Training is provided in techniques of critical analysis and independent research. Three credits. Prerequisites: Senior year status and satisfactory completion of a minimum of 12 credits in advanced economics. Permission of the Chair and the Dean.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"017470","Subject":"ENG","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. To be eligible, students must have upper-junior or senior status, a cumulative GPA of 3.00, a GPA of 3.25 in their major subject, the permission of the Chair of the Department, and the permission of the Dean. A total of six credits of Honors Study is the maximum allowed. The student may take only three credits of Honors Study in a single semester.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"001064","Subject":"ENG","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. To be eligible, students must have upper-junior or senior status, a cumulative GPA of 3.00, a GPA of 3.25 in their major subject, the permission of the Chair of the Department, and the permission of the Dean. A total of six credits of Honors Study is the maximum allowed. The student may take only three credits of Honors Study in a single semester.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"000502","Subject":"ENG","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Independent studies in areas of specialized interest are available. The student may take only three credits of Independent Study in a single semester. Additional pre-requisite: Permission of Department Chair and permission of the Dean.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"006529","Subject":"ENG","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Independent studies in areas of specialized interest are available. The student may take only three credits of Independent Study in a single semester. Additional pre-requisite: Permission of Department Chair and permission of the Dean.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"021845","Subject":"ENG","Catalog":"199","Long Title":"Internship","Component":"IND","Descr":"Provides academic credit to English and Humanities majors who engage in off-campus internships and on-the-job projects under the supervision of English, Philosophy or Languages faculty. Students submit reports about their experiences as interns. On-site supervisors provide evaluation. May be taken more than once.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"005022","Subject":"ENG","Catalog":"191","Long Title":"Senior Thesis in Creative Writing","Component":"IND","Descr":"English majors may elect to write a thesis, depending on their intellectual interests and future academic plans. The decision whether to write a thesis should be made in consultation with the student's English Department faculty mentor. Ideally, students seeking to write creative writing theses will prepare for the project by concentrating on creative writing in their major coursework (see prerequisites below). Prerequisites: 12 credits in upper division creative writing courses and permission of Department Chair. Offered as a tutorial.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"004282","Subject":"ENG","Catalog":"190","Long Title":"Senior Thesis in Literature","Component":"IND","Descr":"English majors may elect to write a thesis, depending on their intellectual interests and future academic plans. The decision whether to write a thesis should be made in consultation with the student's English Department faculty mentor. Ideally, students seeking to write literature theses will prepare for the project by concentrating on literature in their major coursework (see prerequisites below). Prerequisites: 12 credits in upper division literature courses and permission of Department Chair. Offered as a tutorial.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"001817","Subject":"ENG","Catalog":"192","Long Title":"Senior Thesis in Writing and Rhetoric","Component":"IND","Descr":"English majors may elect to write a thesis, depending on their intellectual interests and future academic plans. The decision whether to write a thesis should be made in consultation with the student's English Department faculty mentor. Students seeking to write theses in writing and rhetoric will prepare for the project by concentrating on writing and rhetoric in their major coursework (see prerequisites below). Prerequisites: 12 credits in upper division writing and rhetoric courses and permission of Department Chair. Offered as a tutorial.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"003711","Subject":"ESW","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Each student will work closely with a faculty member or clinical supervisor to complete a research project or clinical rotation. Students will be required to complete a minimum of 90 hours. This course requires additional hours other than the standard meeting times listed in the schedule of classes. This course has an additional fee.","Institution":"LIUNV","Acad Org":"BSPORTSCI"},
{"Course ID":"022005","Subject":"FIL","Catalog":"199","Long Title":"Film Internship","Component":"INT","Descr":"This is an opportunity for the student to work in a professional venue and be directly and meaningfully involved in the day-to-day operations with an emphasis in an area of their special interest.","Institution":"LIUNV","Acad Org":"BMEDFILTV"},
{"Course ID":"022001","Subject":"FIL","Catalog":"188","Long Title":"Film Thesis","Component":"IND","Descr":"Students work with a professor to create an original work that showcases his or her main areas of interest in film.","Institution":"LIUNV","Acad Org":"BMEDFILTV"},
{"Course ID":"000690","Subject":"FIN","Catalog":"393","Long Title":"Independent Study","Component":"IND","Descr":"For students in the last semester of their senior year who require one to three credits to meet minimum requirements for graduation. Students must complete an Application for Independent Study to be approved by the Department Chair and the Dean. Students are assigned to a faculty member who supervises the Independent Study course or project.","Institution":"LIUNV","Acad Org":"BMANAGESCI"},
{"Course ID":"018274","Subject":"FIN","Catalog":"397","Long Title":"Internship Study","Component":"INT","Descr":"This course is designed for Sophomore-Senior students in good academic standing who have taken the introductory course and at least 6 additional credits of advanced coursework in the discipline.  Student's internship must be approved by the department.  Students are assigned to a faculty member who supervises the Internship Study course or project.","Institution":"LIUNV","Acad Org":"BMANAGESCI"},
{"Course ID":"018475","Subject":"FRE","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Independent work for superior students in French.  Offered under the guidance of a Faculty Member.  Permission of the Department and Dean required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"018476","Subject":"FRE","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Independent work for superior students in French.  Offered under the guidance of a Faculty Member.  Permission of the Department and Dean required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"000474","Subject":"FRE","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Independent work for students in French.  Offered under the guidance of a Faculty Member.  Permission of the Department and Dean required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"008159","Subject":"FRE","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Independent work for students in French.  Offered under the guidance of a Faculty Member.  Permission of the Department and Dean required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"005416","Subject":"HHE","Catalog":"195","Long Title":"Honors Independent Study","Component":"IND","Descr":"A student-initiated research project undertaken under the supervision with a faculty mentor. Students must submit a written proposal outlining the project objectives, a reading list, and a clear statement of how the student will be evaluated. The proposal requires approval by the faculty mentor and the Director of the Honors College and is intended for students to acquire skills in high-level research, including vetting, locating and summarizing data mastering critical thinking skills related to the field(s) in question.","Institution":"LIUNV","Acad Org":"BHONORS"},
{"Course ID":"005026","Subject":"HHE","Catalog":"196","Long Title":"Honors Independent Study","Component":"IND","Descr":"A student-initiated research project undertaken under the supervision with a faculty mentor. Students must submit a written proposal outlining the project objectives, a reading list, and a clear statement of how the student will be evaluated. The proposal requires approval by the faculty mentor and the Director of the Honors College and is intended for students to acquire skills in high-level research, including vetting, locating and summarizing data mastering critical thinking skills related to the field(s) in question.","Institution":"LIUNV","Acad Org":"BHONORS"},
{"Course ID":"010034","Subject":"HHE","Catalog":"197","Long Title":"Honors Independent Study","Component":"IND","Descr":"A student-initiated research project undertaken under the supervision with a faculty mentor. Students must submit a written proposal outlining the project objectives, a reading list, and a clear statement of how the student will be evaluated. The proposal requires approval by the faculty mentor and the Director of the Honors College and is intended for students to acquire skills in high-level research, including vetting, locating and summarizing data mastering critical thinking skills related to the field(s) in question. HHE 197 and 198 are designated for students who have already completed one Honors Independent Study, either HHE 195 or HHE 196.","Institution":"LIUNV","Acad Org":"BHONORS"},
{"Course ID":"005752","Subject":"HHE","Catalog":"198","Long Title":"Honors Independent Study","Component":"IND","Descr":"A student-initiated research project undertaken under the supervision with a faculty mentor. Students must submit a written proposal outlining the project objectives, a reading list, and a clear statement of how the student will be evaluated. The proposal requires approval by the faculty mentor and the Director of the Honors College and is intended for students to acquire skills in high-level research, including vetting, locating and summarizing data mastering critical thinking skills related to the field(s) in question. HHE 197 and 198 are designated for students who have already completed one Honors Independent Study, either HHE 195 or HHE 196.","Institution":"LIUNV","Acad Org":"BHONORS"},
{"Course ID":"016391","Subject":"HHE","Catalog":"201","Long Title":"University Honors Special Project","Component":"IND","Descr":"A research project tied specifically to a conference, or presentation of the student's work at a conference, to independent research developed from work initiated in an Honors Advanced Elective Seminar, or to research developed from an Honors travel course. Honors special projects must be approved and closely supervised by a faculty member. Requires the approval of the Director of the Honors College.","Institution":"LIUNV","Acad Org":"BHONORS"},
{"Course ID":"006681","Subject":"HIS","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"001238","Subject":"HIS","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"004104","Subject":"HIS","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Student and faculty member will define a course of study and/or research project. Independent study enrollment requires Chair and Dean approval.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"005000","Subject":"HIS","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Student and faculty member will define a course of study and/or research project. Independent Study enrollment requires Chair and Dean approval","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"019211","Subject":"HS","Catalog":"497","Long Title":"Independent Study","Component":"IND","Descr":"Students taking the Independent Study are expected to research an aspect of Health Science under the supervision of a faculty advisor.  Included in this research can be a practicum/internship experience of a minimum of 30 hours.  Alternatively, a student is able to produce a study of an approved topic, including a thorough literature review and assessment of the topic.  With both options, a final summary project, pre-approved by the faculty advisor, will be presented at the end of the experience.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"019212","Subject":"HS","Catalog":"498","Long Title":"Independent Study","Component":"IND","Descr":"Students taking the Independent Study are expected to research an aspect of Health Science under the supervision of a faculty advisor.  Included in this research can be a practicum/internship experience of a mimimum of 60 hours.  Alternatively, a student is able to prodcue a study of an approved topic, including a thorough literature review and assessment of the topic.  With both options, a final summary project, pre-approved by the faculty advisor, will be presented at the end of the experience.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"019200","Subject":"HS","Catalog":"499","Long Title":"Independent Study","Component":"IND","Descr":"Students taking the Independent Study are expected to research an aspect of Health Science under the supervision of a faculty advisor.  Included in this research can be a practicum/internship experience of a minimum of 90 hours.  Alternatively, a student is able to produce a study of an approved topic, including a thorough literature review and assessment of the topic.  With both options, a final summary project, pre-approved by the faculty advisor, will be presented at the end of the experience.","Institution":"LIUNV","Acad Org":"BBIOLOGY"},
{"Course ID":"010035","Subject":"HSM","Catalog":"109","Long Title":"Honors Research Seminar","Component":"SEM","Descr":"This course builds on the skills learned in HSM 27 and requires students to do original research using primary sources on a special topic in the social sciences, natural sciences or humanities.  With faculty guidance, students may use select local archives, special collections, and museums to study historical documents, data and objects, or they may conduct fieldwork by interviewing and observing subjects. Students learn how to devise research problems and strategies for solving them; to collect, analyze, and interpret their findings; and to present their work to a scholarly community.","Institution":"LIUNV","Acad Org":"BHONORS"},
{"Course ID":"002164","Subject":"HSM","Catalog":"110","Long Title":"Honors Research Seminar","Component":"SEM","Descr":"This course builds on the skills learned in HSM 27 and requires students to do original research using primary sources on a special topic in the humanities or social sciences.  With faculty guidance, students may use select local archives, special collections, and museums to study historical documents and objects, or they may conduct fieldwork by interviewing and observing subjects. Students learn how to devise research problems and strategies for solving them; to collect, analyze, and interpret their findings; and to present their work to a scholarly community.","Institution":"LIUNV","Acad Org":"BHONORS"},
{"Course ID":"017124","Subject":"HUM","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Independent Study is designed to give students the opportunity to do independent work under the supervision of a faculty member.  To be eligible for independent study, students must propose a topic in the humanities to a faculty member in the Department of English, Philosophy, and Languages, and get the approval of the faculty member, Department Chair, and Dean. The student and faculty member will negotiate the readings and main project to be completed during the independent study.  Usually, but not always, this project takes the form of a long research paper submitted at the end of the semester.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"017125","Subject":"HUM","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Independent Study is designed to give students the opportunity to do independent work under the supervision of a faculty member.  To be eligible for independent study, students must propose a topic in the humanities to a faculty member in the Department of English, Philosophy, and Languages, and get the approval of the faculty member, Department Chair, and Dean. The student and faculty member will negotiate the readings and main project to be completed during the independent study.  Usually, but not always, this project takes the form of a long research paper submitted at the end of the semester.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"019193","Subject":"HUM","Catalog":"1981","Long Title":"Independent Study","Component":"IND","Descr":"Independent Study is designed to give students the opportunity to do independent work under the supervision of a faculty member.  To be eligible for independent study, students mus propose a topic in the humanities to a member of the Humanities faculty, and get the approval of the faculty member, Division Coordinator, and Dean.  The student and faculty member will negotiate the readings and main project to be completed during the independent study.  Usually, but not always, this project takes the form of a long research paper submitted at the end of the semester.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"021845","Subject":"HUM","Catalog":"199","Long Title":"Internship","Component":"IND","Descr":"Provides academic credit to English and Humanities majors who engage in off-campus internships and on-the-job projects under the supervision of English, Philosophy or Languages faculty. Students submit reports about their experiences as interns. On-site supervisors provide evaluation. May be taken more than once.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"009257","Subject":"ITL","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Independent work for students of Italian offered under the guidance of a Faculty Member.  Department permission required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"004850","Subject":"ITL","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Independent work for students in Italian offered under the guidance of a Faculty Member.  Department permission required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"002684","Subject":"JOU","Catalog":"161","Long Title":"Campus News Media Internship","Component":"INT","Descr":"Journalism majors work as editors/managers on Seawanhaka and other campus news media with emphasis on advancing their portfolios and leadership skills. Permission of the Department Chair and supervising faculty member are required.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"009841","Subject":"JOU","Catalog":"162","Long Title":"Campus News Media Internship","Component":"INT","Descr":"Journalism majors work as editors/managers on Seawanhaka and other campus news media with emphasis on advancing their portfolios and leadership skills. Permission of the Department Chair and supervising faculty member are required.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"003003","Subject":"JOU","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Provides outstanding students an opportunity to pursue independent work in their major under the guidance of a faculty member. No regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative GPA of 3.0, a 3.25 GPA in their major, and permission of the Department Chair and the Dean. A maximum of six credits of Honors Study is allowed.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"007420","Subject":"JOU","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Gives outstanding students an opportunity to pursue independent work in their major under the guidance of a faculty member. No regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative GPA of 3.0, a 3.25 GPA in their major, and permission of the Department Chair and the Dean. A maximum of six credits of Honors Study is allowed.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"002667","Subject":"JOU","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Students conduct research on mass-media topics or perform intensive professional internships under the supervision of a Journalism faculty member. Prerequisite: Permission of the Department Chair and the Dean.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"005187","Subject":"JOU","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Students conduct research on mass-media topics or perform intensive professional internships under the supervision of a Journalism faculty member. Prerequisite: Permission of the Department Chair and the Dean.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"002008","Subject":"JOU","Catalog":"160","Long Title":"Journalism Internship","Component":"INT","Descr":"Provides academic credit to journalism majors who engage in off-campus internships and on-the-job projects under the supervision of the Journalism department. Students submit reports about their experiences as interns and provide evaluations from their on-site supervisors. May be taken up to four times. Pass/Fail only.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"009453","Subject":"MA","Catalog":"195","Long Title":"Honors Study I","Component":"IND","Descr":"Honors Study I is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Director of the Department and the Dean. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BMEDFILTV"},
{"Course ID":"003323","Subject":"MA","Catalog":"196","Long Title":"Honors Study II","Component":"IND","Descr":"Honors Study II is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Director of the Department and the Dean. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BMEDFILTV"},
{"Course ID":"004682","Subject":"MA","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"This course is designed to give students in their junior or senior year an opportunity to do independent work under the guidance of a member of the Media Arts faculty. There are no regular class meetings. Students may undertake either a production (video, screenplay, photography, graphic design or Audio Production) or a research paper.","Institution":"LIUNV","Acad Org":"BMEDFILTV"},
{"Course ID":"002864","Subject":"MA","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"This course is designed to give students in their junior or senior year an opportunity to do independent work under the guidance of a member of the Media Arts faculty. There are no regular class meetings. Students may undertake either a production (video, screenplay, photography, graphic design or Audio Production) or a research paper.","Institution":"LIUNV","Acad Org":"BMEDFILTV"},
{"Course ID":"008548","Subject":"MA","Catalog":"199","Long Title":"Media Arts Internship","Component":"INT","Descr":"During their junior and senior years, Media Arts majors are strongly recommended to undertake an internship with a media industry organization in New York City. Consultation with the Department Internship Coordinator and the approval of the Department Chair is required. May be taken more than once for credit.","Institution":"LIUNV","Acad Org":"BMEDFILTV"},
{"Course ID":"019229","Subject":"MA","Catalog":"202","Long Title":"Media Arts Internship","Component":"INT","Descr":"During their senior year, Media Arts majors are strongly recommended to undertake one internship with a media organization. Consultation with Director of Professional Development and approval of the Department is required. May be taken more than once for credit.","Institution":"LIUNV","Acad Org":"BMEDFILTV"},
{"Course ID":"009464","Subject":"MAN","Catalog":"393","Long Title":"Independent Study","Component":"IND","Descr":"For those students in the last semester of their senior year who require one to three credits to meet minimum requirements for graduation. Students must complete an Application for Independent Study to be approved by the Department Chair and the Dean. Students are assigned to a faculty member who supervises the Independent Study course or project. Students may be required to write a research paper or take a comprehensive examination (or both) in addition to all other course requirements. One credit to three credits.","Institution":"LIUNV","Acad Org":"BMANAGESCI"},
{"Course ID":"018275","Subject":"MAN","Catalog":"397","Long Title":"Internship Study","Component":"INT","Descr":"For Sophomore-Senior student in good academic standing who has taken the introductory course in the discipline and at least 6 additional credits of advanced coursework in the discipline.  Student's internship must be approved by the department.  Students are assigned to a faculty member who supervises the Internship Study course or project.  Students may be required to write a research paper or complete a project in addition to all other course requirements.","Institution":"LIUNV","Acad Org":"BMANAGESCI"},
{"Course ID":"015782","Subject":"MKT","Catalog":"337","Long Title":"Advanced Market Research","Component":"LEC","Descr":"The application of marketing research to problem areas such as sales management, market potential, advertising pre-testing and post-testing, and new product introduction and distribution. The use of marketing research as a tool in specialized areas such as sales forecasting, media evaluation, consumer motivation, and buyer behavior is explored. Mathematical programming and case studies are used.","Institution":"LIUNV","Acad Org":"BMANAGESCI"},
{"Course ID":"000314","Subject":"MKT","Catalog":"393","Long Title":"Independent Study","Component":"IND","Descr":"For those students in the last semester of their senior year who require one to three credits to meet minimum requirements for graduation. Students must complete an Application for Independent Study to be approved by the Department Chair and the Dean. Students are assigned to a faculty member who supervises the Independent Study course or project. Students may be required to write a research paper in addition to all other course requirements.","Institution":"LIUNV","Acad Org":"BMANAGESCI"},
{"Course ID":"018119","Subject":"MKT","Catalog":"397","Long Title":"Internship Study","Component":"INT","Descr":"For Sophomore-Senior student in good academic standing who has taken the introductory course in the discipline and at least 6 additional credits of advanced coursework in the discipline.  Student's internship must be approved by the department.  Students are assigned to a faculty member who supervises the Internship Study course or project.  Students my be required to write a research paper or complete a project in addition to all other course requirements.","Institution":"LIUNV","Acad Org":"BMANAGESCI"},
{"Course ID":"003180","Subject":"MTH","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"009832","Subject":"MTH","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"004662","Subject":"MTH","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Independent study is designed to give students an opportunity to do independent work in mathematics under the guidance of a member of the faculty.  Requires permission of the Department Chair and the Dean.","Institution":"LIUNV","Acad Org":"BCHMPHYMTH"},
{"Course ID":"011059","Subject":"MUS","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the  \nCredits: A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BMUSIC"},
{"Course ID":"018604","Subject":"MUS","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject.\nCredits: A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BMUSIC"},
{"Course ID":"000878","Subject":"MUS","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Credits: 2 or 3 per semester\nPrerequisite: Permission of the departmental advisor and the Dean.  \nmester","Institution":"LIUNV","Acad Org":"BMUSIC"},
{"Course ID":"002330","Subject":"MUS","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Credits: 2 or 3 per semester\nPrerequisite: Permission of the Coordinator of the Music Program and the Dean.","Institution":"LIUNV","Acad Org":"BMUSIC"},
{"Course ID":"000332","Subject":"MUS","Catalog":"185","Long Title":"Music Internship","Component":"INT","Descr":"Music majors may work as interns in  various city-based musical organizations (e.g., music publishing, music management, recording).  For third- and fourth-year Music majors only.","Institution":"LIUNV","Acad Org":"BMUSIC"},
{"Course ID":"007973","Subject":"PHI","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean. Three credits satisfy the WAC requirement for Philosophy majors. A total of six credits of Honors Study is allowed.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"010156","Subject":"PHI","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean. Three credits satisfy the WAC requirement for Philosophy majors. A total of six credits of Honors Study is allowed.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"001111","Subject":"PHI","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Independent Study offers students of philosophy an opportunity to do concentrated work on issues that interest them, according to a design of study worked out in collaboration with a member of the faculty.  Meeting times and writing requirements are mutually agreed upon prior to the beginning of the semester.  To be eligible, students must have a cumulative quality-point ratio of 3.00 and a quality-point ratio of 3.00 in their major subject, and the permission of the Chair of the Department and the Dean.  A total of six credits of Independent Study is allowed.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"010355","Subject":"PHI","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Independent Study offers students of philosophy an opportunity to do concentrated work on issues that interest them, according to a design of study worked out in collaboration with a member of the faculty.  Meeting times and writing requirements are mutually agreed upon prior to the beginning of the semester.  To be eligible, students must have a cumulative quality-point ratio of 3.00 and a quality-point ratio of 3.00 in their major subject, and the permission of the Chair of the Department and the Dean.  A total of six credits of Independent Study is allowed.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"001076","Subject":"PHY","Catalog":"197","Long Title":"Independent Study I","Component":"IND","Descr":"Directed reading and research.  Designed to fit the individual interests and skills of the student.","Institution":"LIUNV","Acad Org":"BPHYSICS"},
{"Course ID":"020773","Subject":"PHY","Catalog":"198","Long Title":"Independent Study II","Component":"IND","Descr":"Second semester of directed reading and research.","Institution":"LIUNV","Acad Org":"BPHYSICS"},
{"Course ID":"018728","Subject":"POL","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty.  There are no regular class meetings.  To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean.  A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"001799","Subject":"POL","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty.  There are no regular class meetings.  To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean.  A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"007820","Subject":"POL","Catalog":"197","Long Title":"Independent Study/Internship","Component":"IND","Descr":"Research associated with working assignments closely related to the student's specific courses.  Students may develop internships.  Requires approval of the Departmental Chair and the Dean.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"002839","Subject":"POL","Catalog":"198","Long Title":"Independent Study/Internship","Component":"IND","Descr":"Research associated with working assignments closely related to the student's specific courses.  Students may develop internships.  Requires approval of the Departmental Chair and the Dean.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"009864","Subject":"POL","Catalog":"190","Long Title":"Senior Honors Thesis","Component":"IND","Descr":"A year long program of work with a faculty mentor in shaping a thesis idea, developing a methodology, and writing a research thesis.  To be eligible, students must be seniors with a major grade point average of 3.25 or better and an overall cumulative grade point average of 3.00 or better and have approval of the Political Science Department.  Required for students wishing to graduate with honors as a Political Science major.  Political Science 190 and 191 must be completed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"006701","Subject":"POL","Catalog":"191","Long Title":"Senior Honors Thesis","Component":"IND","Descr":"A year long program of work with a faculty mentor in shaping a thesis idea, developing a methodology, and writing a research thesis.  To be eligible, students must be seniors with a major grade point average of 3.25 or better and an overall cumulative grade point average of 3.00 or better and have approval of the Political Science Department.  Required for students wishing to graduate with honors as a Political Science major.  Political Science 190 and 191 must be completed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"001468","Subject":"PSY","Catalog":"281","Long Title":"Advanced Research Design and Statistics","Component":"LEC","Descr":"This course is an advanced class that assumes some knowledge of general experimental psychology and introduces students to more advanced research designing, data collection techniques and data analyses such as multivariate analyses.","Institution":"LIUNV","Acad Org":"BPSYGRAD"},
{"Course ID":"001995","Subject":"PSY","Catalog":"228","Long Title":"Fieldwork in Psychology","Component":"FLD","Descr":"Students perform eight hours of supervised volunteer work per week in applied psychology in an approved community/social service agency - for example a daycare center, a drug abuse center, a program for pregnant teenagers.  In conjunction with the supervised experience, students meet as a group once a week to integrate what they are doing with the more traditional theoretical/academic work. Students must find their own placements. Prerequisite: At least 15 credits in advanced Psychology.","Institution":"LIUNV","Acad Org":"BPSYGRAD"},
{"Course ID":"010360","Subject":"PSY","Catalog":"295","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BPSYGRAD"},
{"Course ID":"002316","Subject":"PSY","Catalog":"296","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean. A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BPSYGRAD"},
{"Course ID":"010936","Subject":"PSY","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Independent Study is designed to give students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have the permission of the Chair of the Department and the Dean. A total of six credits of Independent Study (from PSY 297 and PSY 298) is the maximum allowed. Prerequisite: Permission of the Chair of the Department and the Dean.","Institution":"LIUNV","Acad Org":"LIUNV"},
{"Course ID":"010936","Subject":"PSY","Catalog":"297","Long Title":"Independent Study","Component":"IND","Descr":"Independent Study is designed to give students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have the permission of the Chair of the Department and the Dean. A total of six credits of Independent Study (from PSY 297 and PSY 298) is the maximum allowed. Prerequisite: Permission of the Chair of the Department and the Dean.","Institution":"LIUNV","Acad Org":"BPSYGRAD"},
{"Course ID":"001446","Subject":"PSY","Catalog":"298","Long Title":"Independent Study","Component":"IND","Descr":"Independent Study is designed to give students an opportunity to do independent work in their major under the guidance of a member of the faculty. There are no regular class meetings. To be eligible, students must have the permission of the Chair of the Department and the Dean. A total of six credits of Independent Study (from PSY 297 and PSY 298) is the maximum allowed. Prerequisite: Permission of the Chair of the Department and the Dean.","Institution":"LIUNV","Acad Org":"BPSYGRAD"},
{"Course ID":"007774","Subject":"RC","Catalog":"301","Long Title":"Independent Study","Component":"IND","Descr":"The student will be challenged to thoroughly investigate an aspect of Evidenced-Based Medicine as it pertains to respiratory care. This course is open only to matriculated Respiratory Care students or those with permission of the director. A letter grade of \"C+\" or better is required for graduation.","Institution":"LIUNV","Acad Org":"BRESPCARE"},
{"Course ID":"022191","Subject":"SCM","Catalog":"152","Long Title":"Sports Communications & Marketing Internship","Component":"INT","Descr":"This individually arranged course aligns traditional coursework with practical industry experience and allows students to develop skills, network, and launch a career in sports before graduation. With more than 100 hours spent in the workplace, students are challenged to put theory into practice.","Institution":"LIUNV","Acad Org":"BSPORT"},
{"Course ID":"003720","Subject":"SOC","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty. To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00, a 3.25 ratio in their major, and the permission of the Chair of the Department and of the Dean.  A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"010734","Subject":"SOC","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Students undertake rigorous, semester-long independent work under the supervision of a faculty member.  The topic and specific assignments to be be completed must be agreed upon in advance and approved by the Department Chair and the Dean.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"007213","Subject":"SOC","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Students undertake rigorous, semester-long independent work under the supervision of a faculty member.  The topic and specific assignments to be be completed must be agreed upon in advance and approved by the Department Chair and the Dean.","Institution":"LIUNV","Acad Org":"BSOCSCI"},
{"Course ID":"004848","Subject":"SPA","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Independent work for students in Spanish under the guidance of a Faculty Member. Permission of the Chair of the Department and the Dean required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"012747","Subject":"SPA","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Independent work under the guidance of a Faculty Member. Permission of the Chair of the Department and the Dean required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"006144","Subject":"SPA","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Independent work for students in Spanish offered under the guidance of a Faculty member.  Department permission required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"007221","Subject":"SPA","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Independent work for students in Spanish offered under the guidance of a Faculty Member.  Department permission required.","Institution":"LIUNV","Acad Org":"BENGPHIMOD"},
{"Course ID":"007442","Subject":"SPE","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty.  There are no regular class meetings.  To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean.  A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"004481","Subject":"SPE","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work in their major under the guidance of a member of the faculty.  There are no regular class meetings.  To be eligible, students must have upper junior or senior status, a cumulative quality-point ratio of 3.00 and a 3.25 ratio in their major subject, and the permission of the Chair of the Department and the Dean.  A total of six credits of Honors Study is the maximum allowed.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"000696","Subject":"SPE","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Courses designed to give students in their junior or senior year an opportunity to work under the guidance of a member of the communications faculty.  There are no regular class meetings.  Students may undertake either a production or research paper.  Department Chair and the Dean must grant permission.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"006704","Subject":"SPE","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Courses designed to give students in their junior or senior year an opportunity to work under the guidance of a member of the communications faculty.  There are no regular class meetings.  Students may undertake either a production or research paper.  Department Chair and the Dean must grant permissions.","Institution":"LIUNV","Acad Org":"BJOUCOMST"},
{"Course ID":"020899","Subject":"SPM","Catalog":"366","Long Title":"Internship in Sport Management","Component":"PRA","Descr":"This is an individually arranged course that combines work experience with a related academic or creative project. The course is intended to afford students an opportunity to apply theoretical classroom information in a real world environment, and develop skills beneficial to students seeking careers in sport management. The internship requires a minimum of 240 hours, but students may need to perform additional hours based on the decision of the internship site.","Institution":"LIUNV","Acad Org":"BSPORT"},
{"Course ID":"006176","Subject":"SWK","Catalog":"197","Long Title":"Independent Study","Component":"IND","Descr":"Students are able to work intensively with faculty on a topic of interest.","Institution":"LIUNV","Acad Org":"BSOCWORK"},
{"Course ID":"007615","Subject":"SWK","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"Students are able to work intensively with faculty on a topic of interest.","Institution":"LIUNV","Acad Org":"BSOCWORK"},
{"Course ID":"020908","Subject":"SWK","Catalog":"199","Long Title":"Independent Study","Component":"IND","Descr":"Independent Study","Institution":"LIUNV","Acad Org":"BSOCWORK"},
{"Course ID":"001115","Subject":"SWK","Catalog":"180","Long Title":"Social Work Fieldwork I","Component":"INT","Descr":"During senior year, students complete an intensive field internship (a minimum of 200 hours during fall semester and 200 hours during spring semester = 400 hours) at approved social service programs with professional social work supervision. Students apply the theories and knowledge learned in the classroom to develop and strengthen their social work skills in practice. An integral part of the internship experience is the accompanying field seminar, SWK 182.","Institution":"LIUNV","Acad Org":"BSOCWORK"},
{"Course ID":"001098","Subject":"SWK","Catalog":"181","Long Title":"Social Work Fieldwork II","Component":"INT","Descr":"During senior year, students complete an intensive field internship (a minimum of 200 hours during fall semester and 200 hours during spring semester = 400 hours) at approved social service programs with professional social work supervision. Students apply the theories and knowledge learned in the classroom to develop and strengthen their social work skills in practice. An integral part of the internship experience is the accompanying field seminar course, SWK 183.","Institution":"LIUNV","Acad Org":"BSOCWORK"},
{"Course ID":"022102","Subject":"TEP","Catalog":"198","Long Title":"Independent Study","Component":"IND","Descr":"This course is designed to give students an opportunity to do independent work under to guidance of a member of the Roc Nation faculty. There are no regular class meetings. Students may undertake either a production, (video, musical composition, instrumental study or research paper.","Institution":"LIUNV","Acad Org":"BMUSIC"},
{"Course ID":"021250","Subject":"TEP","Catalog":"205","Long Title":"Internship","Component":"INT","Descr":"Students are required to take on a field placement experience in their area of concentration.","Institution":"LIUNV","Acad Org":"BMUSIC","field9":"","field10":"","field11":"","field12":"","field13":"","field14":"","field15":"Y"},
{"Course ID":"021281","Subject":"TEP","Catalog":"301","Long Title":"Thesis/ Culminating Project","Component":"IND","Descr":"This class represents the culmination of each student's work in the program and the experience through which students synthesize all they have learned.  The culminating experience helps to shape students' next steps in the profession and in their career.  Thesis projects can consist of a research project, a creative project, a practical project, and/or another project of the student's devising.","Institution":"LIUNV","Acad Org":"BMUSIC"},
{"Course ID":"021200","Subject":"TFT","Catalog":"199","Long Title":"Internship","Component":"INT","Descr":"This course provides students with an opportunity to gain field experience in theater, film, television and entertainment organizations. Examples of appropriate organizations are BAM, St. Anns Warehouse, Mark Morris Dance Group, Creative Artist Agency, Dreamworks, FOX Studios, MTV, Nickelodeon, and Sony Pictures Studio.","Institution":"LIUNV","Acad Org":"BMEDFILTV"}
,
{"Course ID":"018285","Subject":"THE","Catalog":"195","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work under the guidance of a member of the faculty.  There are no regular class meetings.  To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00, a 3.25 ratio in their major subject and the permission of the Chair of the Performing Arts Department and the Dean.  A total of six credits of Honors Study is the maximum allowed.  Three credits per semester.","Institution":"LIUNV","Acad Org":"BMEDFILTV"},
{"Course ID":"018286","Subject":"THE","Catalog":"196","Long Title":"Honors Study","Component":"IND","Descr":"Honors Study is designed to give outstanding students an opportunity to do independent work under the guidance of a member of the faculty.  There are no regular class meetings.  To be eligible, students must have upper-junior or senior status, a cumulative quality-point ratio of 3.00, a 3.25 ratio in their major subject and the permission of the Chair of the Performing Arts Department and the Dean.  A total of six credits of Honors Study is the maximum allowed.  Three credits per semester.","Institution":"LIUNV","Acad Org":"BMEDFILTV"}
]
